core/src/test/resources/sampleSoapService/request2.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cs="https://predic8.de/city-service">
    <s:Body>
        <cs:getCityDetails>
            <city>London</city>
        </cs:getCityDetails>
    </s:Body>
</s:Envelope>